# Intro python data science
## Pr치ctica 07: importar datos de excel a python

Vamos a ver c칩mo importar excel cuando:
* Punto 1: tenemos datos con nombre de columna y en la primera hoja
* Punto 2: los datos no est치n en la primera hoja
* Punto 3: no hay nombres de columnas

# Punto 0:

In [1]:
# importar pandas
import pandas as pd

In [43]:
# extraer ruta del archivo
path = 'datos_rrss.xlsx'

# Punto 1:

In [44]:
# caso 1: datos completos en la primera hoja

In [45]:
pd.read_excel(path)

      Nombre  Cantidad  ES_FBK   A침o
0   Facebook      2449    True  2006
1    Twitter       339   False  2006
2  Instagram      1000    True  2010
3    YouTube      2000   False  2005
4   LinkedIn       663   False  2003
5   WhatsApp      1600    True  2009

# Punto 2:

In [ ]:
# caso 2: los datos no est치n en la primera hoja

In [46]:
pd.read_excel(path, 
              sheet_name='Hoja2')

      Nombre  Cantidad  ES_FBK   A침o
0   Facebook      2449    True  2006
1    Twitter       339   False  2006
2  Instagram      1000    True  2010

# Punto 3:

In [ ]:
# caso 3: no hay nombres de columnas

In [48]:
pd.read_excel(path, 
              sheet_name='Hoja3')

    Facebook  2449   True  2006
0    Twitter   339  False  2006
1  Instagram  1000   True  2010
2    YouTube  2000  False  2005
3   LinkedIn   663  False  2003
4   WhatsApp  1600   True  2009

In [47]:
pd.read_excel(path, 
              sheet_name='Hoja3', 
              header=None,
              names=['Nombre', 'Cantidad', 'ES_FBK', 'A침o'])

      Nombre  Cantidad  ES_FBK   A침o
0   Facebook      2449    True  2006
1    Twitter       339   False  2006
2  Instagram      1000    True  2010
3    YouTube      2000   False  2005
4   LinkedIn       663   False  2003
5   WhatsApp      1600    True  2009

# Gracias!
## Espero que te lleves algo 칰til de este notebook 游

Para m치s videos de programaci칩n para ciencia de datos

https://www.youtube.com/c/RafaGonzalezGouveia/

Si quieres realizar alguno de los cursos online de pago, ve a:

https://cursos.gonzalezgouveia.com